dgarske/wolfssl-examples/rtl8735b/main.c
/* wolfCrypt AmebaPro2 (RTL8735B) HUK example -- built inside the RealTek
 * FreeRTOS SDK. Registers the wolfCrypt HUK crypto-callback device and runs
 * AES-GCM (full payload) / AES-ECB / AES-CBC / AES-CTR, HMAC-SHA256, and ECDSA
 * P-256 under a key derived from the silicon Hardware Unique Key; the working
 * key never enters software. The 256-bit "seed" passed as the key is HKDF input
 * diversifying the HUK. It also runs regression checks: unaligned-buffer GCM
 * (port bounce path), in-place multi-call CBC, and a non-12-byte GCM IV that
 * must hard-fail (no silent software fallback).
 *
 * With WOLFSSL_RTL8735B_AES also enabled it registers a second crypto-callback
 * device (WC_RTL8735B_AES_DEVID) that runs a caller-supplied plaintext AES key
 * directly on the HW engine (no HUK binding), selected per Aes by devId, and
 * exercises it with AES-GCM (published KAT + coexistence), an AES-ECB FIPS-197
 * KAT, the unaligned-buffer bounce path, and non-12-byte-IV rejection.
 *
 * Build: configure with -DEXAMPLE=wolfcrypt_huk (see wolfcrypt_huk.cmake).
 */

#include <string.h>

#include "platform_stdlib.h"
#include "FreeRTOS.h"
#include "task.h"
#include "device_lock.h"
#include "hal_trng_sec.h"

#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/wc_port.h>
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/hmac.h>
#include <wolfssl/wolfcrypt/ecc.h>
#include <wolfssl/wolfcrypt/random.h>
#include <wolfssl/wolfcrypt/error-crypt.h>
#include <wolfssl/wolfcrypt/port/realtek/rtl8735b.h>

/* ForceZero (used to scrub key material below). Inline the misc helpers the same
 * way wolfCrypt's own test.c/benchmark.c do; misc.c provides ForceZero only as an
 * inline, so a plain extern reference would not link. */
#ifdef NO_INLINE
    #include <wolfssl/wolfcrypt/misc.h>
#else
    #define WOLFSSL_MISC_INCLUDED
    #include <wolfcrypt/src/misc.c>
#endif

#define STACKSIZE 8192

#define CHECK(label, cond) \
    dbg_printf("[%s] %s\r\n", (cond) ? "PASS" : "FAIL", (label))

/* wolfCrypt RNG seed hook (user_settings: CUSTOM_RAND_GENERATE_SEED). Fills from
 * the AmebaPro2 secure (self-tested) hardware TRNG -- the same source the HUK
 * port exposes as a crypto-callback SEED. (Using the secure TRNG directly also
 * avoids the non-secure hal_trng wrapper, whose C-cut path references a ROM
 * symbol not resolvable in a from-source SDK build.) */
int rtl8735b_rand_seed(unsigned char* output, unsigned int sz)
{
    static int inited = 0;
    unsigned int i, n;
    u32 r;

    if (inited == 0) {
        if (hal_trng_sec_init() != 0) {
            return -1;
        }
        inited = 1;
    }
    for (i = 0; i < sz; ) {
        r = hal_trng_sec_get_rand();
        n = (sz - i) < 4u ? (sz - i) : 4u;
        memcpy(output + i, &r, n);
        i += n;
    }
    return 0;
}

static void huk_gcm_test(void)
{
    Aes  aes;
    /* HAL crypto engine requires 32-byte-aligned key/iv/aad/tag buffers. */
    byte seed[32] __attribute__((aligned(32)));
    byte iv[12]   __attribute__((aligned(32)));
    byte aad[16]  __attribute__((aligned(32)));
    byte pt[32]   __attribute__((aligned(32)));
    byte ct[32]   __attribute__((aligned(32)));
    byte dec[32]  __attribute__((aligned(32)));
    byte tag[16]  __attribute__((aligned(32)));
    byte tag2[16] __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0xA5, sizeof(seed)); memset(iv, 0x11, sizeof(iv));
    memset(aad, 0x22, sizeof(aad));   memset(pt, 0x33, sizeof(pt));

    dbg_printf("\r\n== AES-GCM (full payload) under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(seed,32)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }

    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("AesGcmEncrypt", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }

    memset(tag2, 0, sizeof(tag2));
    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag2, sizeof(tag2), aad, sizeof(aad));
    CHECK("deterministic tag", ret == 0 && memcmp(tag, tag2, 16) == 0);

    ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("AesGcmDecrypt verifies", ret == 0);
    CHECK("plaintext round-trips", memcmp(dec, pt, sizeof(pt)) == 0);

    seed[0] ^= 0xFF;
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(wrong seed)", ret == 0);
    ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("wrong seed -> AES_GCM_AUTH_E", ret == AES_GCM_AUTH_E);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

static void huk_ecb_cbc_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[32]   __attribute__((aligned(32)));
    byte ct[32]   __attribute__((aligned(32)));
    byte dec[32]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x44, sizeof(iv));
    memset(pt, 0x77, sizeof(pt));

    dbg_printf("\r\n== AES-ECB under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_ENCRYPTION);
    CHECK("AesSetKey(ECB enc)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesEcbEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesEcbEncrypt", ret == 0);
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_DECRYPTION);
    CHECK("AesSetKey(ECB dec)", ret == 0);
    ret = wc_AesEcbDecrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesEcb round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);

