dgarske/wolfssl-examples/rtl8735b/main.c
    dbg_printf("\r\n== AES-CBC under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKey(CBC enc)", ret == 0);
    ret = wc_AesCbcEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesCbcEncrypt", ret == 0);
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_DECRYPTION);
    CHECK("AesSetKey(CBC dec)", ret == 0);
    ret = wc_AesCbcDecrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesCbc round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

static void huk_ctr_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[20]   __attribute__((aligned(32))); /* non-block-multiple: partial */
    byte ct[20]   __attribute__((aligned(32)));
    byte dec[20]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x66, sizeof(iv));
    memset(pt, 0x99, sizeof(pt));

    dbg_printf("\r\n== AES-CTR under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKeyDirect(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKeyDirect(CTR)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesCtrEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesCtrEncrypt", ret == 0);
    CHECK("CTR ciphertext != plaintext", memcmp(ct, pt, sizeof(pt)) != 0);
    wc_AesFree(&aes);

    /* CTR is its own inverse with the same key+IV */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKeyDirect(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKeyDirect(CTR round-trip)", ret == 0);
    ret = wc_AesCtrEncrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesCtr round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

static void huk_gcm_unaligned_test(void)
{
    Aes   aes;
    /* 32-byte-aligned backing; the +1 views below are deliberately unaligned so
     * the port's bounce-to-aligned path is exercised. */
    byte  buf[7][48] __attribute__((aligned(32)));
    byte* seed = buf[0] + 1;
    byte* iv   = buf[1] + 1;
    byte* aad  = buf[2] + 1;
    byte* pt   = buf[3] + 1;
    byte* ct   = buf[4] + 1;
    byte* dec  = buf[5] + 1;
    byte* tag  = buf[6] + 1;
    int   ret;

    memset(seed, 0xA5, 32); memset(iv, 0x11, 12);
    memset(aad, 0x22, 16);  memset(pt, 0x33, 32);

    dbg_printf("\r\n== AES-GCM with UNALIGNED buffers (port bounces) ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, 32);
    CHECK("AesGcmSetKey (unaligned seed)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, 32, iv, 12, tag, 16, aad, 16);
    CHECK("AesGcmEncrypt (unaligned)", ret == 0);
    ret = wc_AesGcmDecrypt(&aes, dec, ct, 32, iv, 12, tag, 16, aad, 16);
    CHECK("AesGcmDecrypt (unaligned) verifies", ret == 0);
    CHECK("unaligned round-trip", memcmp(dec, pt, 32) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, 32);   /* scrub key material before return */
}

/* In-place CBC decrypt (in == out) across two chained calls -- regression for
 * the in-place chaining / IV-advance fix. */
static void huk_cbc_inplace_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[48]   __attribute__((aligned(32)));   /* 3 blocks */
    byte buf[48]  __attribute__((aligned(32)));    /* encrypted then decrypted in place */
    int  ret, i;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x44, sizeof(iv));
    for (i = 0; i < (int)sizeof(pt); i++) {
        pt[i] = (byte)i;
    }
    memcpy(buf, pt, sizeof(pt));

    dbg_printf("\r\n== AES-CBC in-place + multi-call under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKey(CBC enc)", ret == 0);
    ret = wc_AesCbcEncrypt(&aes, buf, buf, sizeof(buf));   /* in == out */
    CHECK("CBC in-place encrypt", ret == 0);
    wc_AesFree(&aes);

    /* Decrypt in place across two calls (32 then 16 bytes) -- the 2nd call relies
     * on aes->reg having been advanced to the correct last-ciphertext block. */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_DECRYPTION);
    CHECK("AesSetKey(CBC dec)", ret == 0);
    ret = wc_AesCbcDecrypt(&aes, buf, buf, 32);
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, buf + 32, buf + 32, 16);
    }
    CHECK("CBC in-place multi-call decrypt", ret == 0);
    CHECK("CBC in-place round-trip", memcmp(buf, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* A non-12-byte GCM IV must hard-fail, NOT silently fall back to software GCM
 * keyed on the seed -- regression for the IV hard-error fix. */
static void huk_gcm_badiv_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));   /* 16 bytes, not the supported 12 */
    byte pt[16]   __attribute__((aligned(32)));
    byte ct[16]   __attribute__((aligned(32)));
    byte tag[16]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0xA5, sizeof(seed)); memset(iv, 0x11, sizeof(iv));
    memset(pt, 0x33, sizeof(pt));

    dbg_printf("\r\n== AES-GCM non-12-byte IV must hard-fail ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(seed,32)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag, sizeof(tag), NULL, 0);
    CHECK("16-byte IV rejected (no silent SW fallback)", ret != 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* HMAC-SHA256 under the HUK-derived key: same seed -> same MAC (deterministic),
 * a different seed -> different MAC. The 32-byte seed is the HMAC key; the port
 * runs the MAC over the HUK-derived secure-key slot (key never in software). */
static void huk_hmac_test(void)
{
    Hmac hmac;
    byte seed[32] __attribute__((aligned(32)));
    byte msg[40]  __attribute__((aligned(32)));
    byte mac1[WC_SHA256_DIGEST_SIZE];
    byte mac2[WC_SHA256_DIGEST_SIZE];
    byte mac3[WC_SHA256_DIGEST_SIZE];
    int  ret;

