dgarske/wolfssl-examples/rtl8735b/main.c
    memset(seed, 0x5A, sizeof(seed));
    memset(msg, 0x33, sizeof(msg));

    dbg_printf("\r\n== HMAC-SHA256 under HUK-derived key ==\r\n");

    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    CHECK("HmacInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    CHECK("HmacSetKey(seed,32)", ret == 0);
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac1);
    }
    CHECK("HmacFinal", ret == 0);
    wc_HmacFree(&hmac);
    if (ret != 0) {
        return;
    }

    /* Same seed + message -> identical MAC. */
    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac2);
    }
    wc_HmacFree(&hmac);
    CHECK("deterministic MAC", ret == 0 &&
          memcmp(mac1, mac2, sizeof(mac1)) == 0);

    /* Different seed -> different MAC. */
    seed[0] ^= 0xFF;
    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac3);
    }
    wc_HmacFree(&hmac);
    CHECK("wrong seed -> different MAC", ret == 0 &&
          memcmp(mac1, mac3, sizeof(mac1)) != 0);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* HUK-bound ECDSA P-256 sign. A key is generated in software, its private
 * scalar wrapped under the HUK (ECB-encrypted with the HUK device using the
 * seed), then signing goes through the HUK device (which unwraps under the HUK
 * and signs). The signature is checked against the software public key. To
 * exercise the HW ECDSA engine instead of the software-after-unwrap path, set
 * hk.useHwEngine = 1 (requires on-silicon validation). */
static void huk_ecdsa_test(void)
{
    Aes    aes;
    ecc_key key;
    ecc_key huk;
    ecc_key hwpub;
    WC_RNG  rng;
    wc_Rtl8735b_EccKey hk;
    byte    seed[32]    __attribute__((aligned(32)));
    byte    d[32]       __attribute__((aligned(32)));
    byte    wrapped[32] __attribute__((aligned(32)));
    byte    wrapIv[12]  __attribute__((aligned(32)));   /* GCM nonce for the wrap */
    byte    wrapTag[16] __attribute__((aligned(32)));   /* GCM auth tag */
    byte    hash[32]    __attribute__((aligned(32)));
    byte    qx[32];
    byte    qy[32];
    byte    sig[80];
    word32  dLen = sizeof(d);
    word32  qxLen = sizeof(qx);
    word32  qyLen = sizeof(qy);
    word32  sigLen = sizeof(sig);
    int     ret;
    int     verified = 0;
    int     hwVerified = 0;
    int     rngOk = 0;

    memset(seed, 0x6B, sizeof(seed));
    memset(hash, 0x42, sizeof(hash));
    memset(d, 0, sizeof(d));
    /* Zero the key structs up front so the single cleanup can wc_ecc_free them
     * safely even if an earlier step fails before they are initialized. */
    memset(&key, 0, sizeof(key));
    memset(&huk, 0, sizeof(huk));
    memset(&hwpub, 0, sizeof(hwpub));

    dbg_printf("\r\n== ECDSA P-256 under HUK-derived key ==\r\n");

    ret = wc_InitRng(&rng);
    CHECK("InitRng", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }
    rngOk = 1;
    ret = wc_ecc_init(&key);
    if (ret == 0) {
        ret = wc_ecc_make_key(&rng, 32, &key);
    }
    CHECK("ecc_make_key (P-256)", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }
    ret = wc_ecc_export_private_only(&key, d, &dLen);
    CHECK("export private scalar (32B)", ret == 0 && dLen == 32);
    if (ret != 0 || dLen != 32) {
        goto cleanup;
    }

    /* Wrap the scalar under the HUK: AES-GCM-encrypt with the HUK device + seed
     * so the blob is authenticated (a tampered/wrong blob fails at unwrap). */
    memset(wrapIv, 0x24, sizeof(wrapIv));   /* demo nonce; use a fresh one/provision */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, wrapped, d, sizeof(d), wrapIv, sizeof(wrapIv),
                               wrapTag, sizeof(wrapTag), NULL, 0);
    }
    wc_AesFree(&aes);
    CHECK("wrap scalar under HUK (GCM)", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }

    /* Sign via the HUK-bound key (GCM-unwraps under the HUK, then signs). */
    memset(&hk, 0, sizeof(hk));
    hk.seed = seed;       hk.seedSz = sizeof(seed);
    hk.wrapped = wrapped; hk.wrappedLen = 32;
    hk.plainLen = 32;
    hk.iv = wrapIv;       hk.ivSz = sizeof(wrapIv);
    hk.tag = wrapTag;     hk.tagSz = sizeof(wrapTag);
    /* Route the sign through the HW ECDSA engine (hal_ecdsa, validated on the
     * RTL8735B). Set 0 for the software-after-unwrap path (the port default).
     * hk.otpPrkSel can instead select an OTP-resident key (scalar never in
     * software); see wolfcrypt/src/port/realtek/README.md. */
    hk.useHwEngine = 1;

    ret = wc_ecc_init_ex(&huk, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_ecc_set_curve(&huk, 32, ECC_SECP256R1);
    }
    if (ret == 0) {
        huk.devCtx = &hk;
        ret = wc_ecc_sign_hash(hash, sizeof(hash), sig, &sigLen, &rng, &huk);
    }
    CHECK("HUK ECDSA sign", ret == 0);

    if (ret == 0) {
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &verified,
                                 &key);
    }
    CHECK("verify with software public key", ret == 0 && verified == 1);

    /* Verify the same signature through the HW ECDSA engine (general verify
     * offload): import the public point into a WC_HUK_DEVID key so the verify
     * dispatches to hal_ecdsa. A good signature -> res = 1; a tampered hash
     * must -> res = 0 (and still return 0, since a bad signature is not an
     * error). No HUK context is needed for verify -- any P-256 public key. */
    ret = wc_ecc_export_public_raw(&key, qx, &qxLen, qy, &qyLen);
    CHECK("export public point", ret == 0);
    if (ret == 0) {
        ret = wc_ecc_init_ex(&hwpub, NULL, WC_HUK_DEVID);
    }
    if (ret == 0) {
        ret = wc_ecc_import_unsigned(&hwpub, qx, qy, NULL, ECC_SECP256R1);
    }
    if (ret == 0) {
        hwVerified = 0;
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &hwVerified,
                                 &hwpub);
    }
    CHECK("HW ECDSA verify (good sig)", ret == 0 && hwVerified == 1);

    if (ret == 0) {
        hash[0] ^= 0xFF;     /* tamper the digest */
        hwVerified = 1;
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &hwVerified,
                                 &hwpub);
        hash[0] ^= 0xFF;     /* restore */
    }
    CHECK("HW ECDSA verify (tampered -> reject)", ret == 0 && hwVerified == 0);

cleanup:
    wc_ecc_free(&hwpub);
    wc_ecc_free(&huk);
    wc_ecc_free(&key);
    if (rngOk != 0) {
        wc_FreeRng(&rng);
    }
    /* Scrub the plaintext private scalar, its wrapped form, and the HKDF seed
     * (zero secrets with ForceZero, not memset, per wolfSSL convention). */
    ForceZero(d, sizeof(d));
    ForceZero(wrapped, sizeof(wrapped));
    ForceZero(seed, sizeof(seed));
}

#ifdef WOLFSSL_RTL8735B_AES
/* AES-GCM with a plaintext key through the second device (WC_RTL8735B_AES_DEVID).
 * Unlike the HUK device, the key bytes are the actual AES key, so the output
 * matches a published GCM vector. Then the same 32 key bytes are run through
 * both devices to show they coexist and are selected per Aes by devId: the
 * plaintext-key ciphertext differs from the HUK device-bound ciphertext. */
static void plain_gcm_test(void)
{
    Aes  aes;
    /* McGrew & Viega GCM test case 3: 128-bit key, 64-byte payload, no AAD. */
    static const byte katKey[16] = {
        0xfe,0xff,0xe9,0x92,0x86,0x65,0x73,0x1c,
        0x6d,0x6a,0x8f,0x94,0x67,0x30,0x83,0x08
    };
    static const byte katIv[12] = {
        0xca,0xfe,0xba,0xbe,0xfa,0xce,0xdb,0xad,0xde,0xca,0xf8,0x88
    };
    static const byte katPt[64] = {
        0xd9,0x31,0x32,0x25,0xf8,0x84,0x06,0xe5,
        0xa5,0x59,0x09,0xc5,0xaf,0xf5,0x26,0x9a,
        0x86,0xa7,0xa9,0x53,0x15,0x34,0xf7,0xda,
        0x2e,0x4c,0x30,0x3d,0x8a,0x31,0x8a,0x72,
        0x1c,0x3c,0x0c,0x95,0x95,0x68,0x09,0x53,
        0x2f,0xcf,0x0e,0x24,0x49,0xa6,0xb5,0x25,
        0xb1,0x6a,0xed,0xf5,0xaa,0x0d,0xe6,0x57,
        0xba,0x63,0x7b,0x39,0x1a,0xaf,0xd2,0x55
    };
    static const byte katCt[64] = {
        0x42,0x83,0x1e,0xc2,0x21,0x77,0x74,0x24,
        0x4b,0x72,0x21,0xb7,0x84,0xd0,0xd4,0x9c,
        0xe3,0xaa,0x21,0x2f,0x2c,0x02,0xa4,0xe0,
        0x35,0xc1,0x7e,0x23,0x29,0xac,0xa1,0x2e,
        0x21,0xd5,0x14,0xb2,0x54,0x66,0x93,0x1c,
        0x7d,0x8f,0x6a,0x5a,0xac,0x84,0xaa,0x05,
        0x1b,0xa3,0x0b,0x39,0x6a,0x0a,0xac,0x97,
        0x3d,0x58,0xe0,0x91,0x47,0x3f,0x59,0x85
    };
    static const byte katTag[16] = {
        0x4d,0x5c,0x2a,0xf3,0x27,0xcd,0x64,0xa6,
        0x2c,0xf3,0x5a,0xbd,0x2b,0xa6,0xfa,0xb4
    };
    /* HAL crypto engine requires 32-byte-aligned key/iv/buffers. */
    byte key[32]    __attribute__((aligned(32)));
    byte iv[12]     __attribute__((aligned(32)));
    byte pt[64]     __attribute__((aligned(32)));
    byte ct[64]     __attribute__((aligned(32)));
    byte ctHuk[64]  __attribute__((aligned(32)));
    byte dec[64]    __attribute__((aligned(32)));
    byte tag[16]    __attribute__((aligned(32)));
    byte tagHuk[16] __attribute__((aligned(32)));
    int  ret;

    dbg_printf("\r\n== AES-GCM with a plaintext key "
               "(devId=WC_RTL8735B_AES_DEVID) ==\r\n");

    /* Known-answer test: the plaintext key must reproduce the published vector.
     * Stage the vector key into the 32-byte-aligned buffer the HAL DMA wants. */
    memcpy(key, katKey, sizeof(katKey));
    memcpy(iv, katIv, sizeof(iv));
    memcpy(pt, katPt, sizeof(pt));
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(devId=WC_RTL8735B_AES_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, key, sizeof(katKey));
    CHECK("AesGcmSetKey(plaintext 128-bit key)", ret == 0);
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
        CHECK("AesGcmEncrypt", ret == 0);
    }
    CHECK("ciphertext matches published vector",
          ret == 0 && memcmp(ct, katCt, sizeof(katCt)) == 0);
    CHECK("tag matches published vector",
          ret == 0 && memcmp(tag, katTag, sizeof(katTag)) == 0);
    if (ret == 0) {
        ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
        CHECK("AesGcmDecrypt verifies", ret == 0);
        CHECK("plaintext round-trips", memcmp(dec, pt, sizeof(pt)) == 0);

