dgarske/wolfssl-examples/rtl8735b/main.c
        /* Negative: a tampered tag must be rejected by the HW decrypt-verify. */
        tag[0] ^= 0xFFu;
        ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
        CHECK("tampered tag -> AES_GCM_AUTH_E", ret == AES_GCM_AUTH_E);
    }
    wc_AesFree(&aes);

    /* Coexistence: same 32 key bytes -> plaintext device vs HUK device produce
     * different ciphertext (one uses the key verbatim, the other as a seed). */
    memset(key, 0x5A, sizeof(key));
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(plaintext devId)", ret == 0);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, key, sizeof(key));
        CHECK("AesGcmSetKey(plaintext 256-bit key)", ret == 0);
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
    }
    wc_AesFree(&aes);
    CHECK("plaintext-key encrypt (256-bit)", ret == 0);
    if (ret == 0) {
        ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
        CHECK("AesInit(HUK devId)", ret == 0);
        if (ret == 0) {
            ret = wc_AesGcmSetKey(&aes, key, sizeof(key));
            CHECK("AesGcmSetKey(HUK seed, same 32 bytes)", ret == 0);
        }
        if (ret == 0) {
            ret = wc_AesGcmEncrypt(&aes, ctHuk, pt, sizeof(pt), iv, sizeof(iv),
                                   tagHuk, sizeof(tagHuk), NULL, 0);
        }
        wc_AesFree(&aes);
        CHECK("HUK-seed encrypt (same 32 bytes)", ret == 0);
        CHECK("plaintext CT != HUK CT (distinct keys per devId)",
              ret == 0 && memcmp(ct, ctHuk, sizeof(ct)) != 0);
    }
    ForceZero(key, sizeof(key));   /* scrub key material before return */
}

/* AES-ECB with a plaintext key: FIPS-197 appendix C.1 known-answer vector. The
 * plaintext device runs the key verbatim, so the HW output must match the
 * published ciphertext exactly (the HUK device cannot -- its key is derived). */
static void plain_ecb_test(void)
{
    Aes  aes;
    static const byte katKey[16] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f
    };
    static const byte katPt[16] = {
        0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
        0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff
    };
    static const byte katCt[16] = {
        0x69,0xc4,0xe0,0xd8,0x6a,0x7b,0x04,0x30,
        0xd8,0xcd,0xb7,0x80,0x70,0xb4,0xc5,0x5a
    };
    byte key[16] __attribute__((aligned(32)));
    byte pt[16]  __attribute__((aligned(32)));
    byte ct[16]  __attribute__((aligned(32)));
    byte dec[16] __attribute__((aligned(32)));
    int  ret;

    memcpy(key, katKey, sizeof(key));
    memcpy(pt, katPt, sizeof(pt));

    dbg_printf("\r\n== AES-ECB with a plaintext key (FIPS-197 KAT) ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(devId=WC_RTL8735B_AES_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, key, sizeof(key), NULL, AES_ENCRYPTION);
    CHECK("AesSetKey(ECB enc)", ret == 0);
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, ct, pt, sizeof(pt));
        CHECK("AesEcbEncrypt", ret == 0);
    }
    CHECK("ciphertext matches FIPS-197 vector",
          ret == 0 && memcmp(ct, katCt, sizeof(katCt)) == 0);
    ret = wc_AesSetKey(&aes, key, sizeof(key), NULL, AES_DECRYPTION);
    CHECK("AesSetKey(ECB dec)", ret == 0);
    if (ret == 0) {
        ret = wc_AesEcbDecrypt(&aes, dec, ct, sizeof(ct));
    }
    CHECK("AesEcb round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(key, sizeof(key));   /* scrub key material before return */
}

/* AES-GCM with a plaintext key over deliberately-unaligned caller buffers, so
 * the port's bounce-to-aligned path is exercised for the second device too. */
static void plain_gcm_unaligned_test(void)
{
    Aes   aes;
    /* 32-byte-aligned backing; the +1 views below are deliberately unaligned. */
    byte  buf[6][48] __attribute__((aligned(32)));
    byte* key = buf[0] + 1;
    byte* iv  = buf[1] + 1;
    byte* pt  = buf[2] + 1;
    byte* ct  = buf[3] + 1;
    byte* dec = buf[4] + 1;
    byte* tag = buf[5] + 1;
    int   ret;

    memset(key, 0x5A, 16); memset(iv, 0x11, 12);
    memset(pt, 0x33, 32);

    dbg_printf("\r\n== AES-GCM plaintext key, UNALIGNED buffers "
               "(port bounces) ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(devId=WC_RTL8735B_AES_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, key, 16);
    CHECK("AesGcmSetKey (unaligned key)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, 32, iv, 12, tag, 16, NULL, 0);
    CHECK("AesGcmEncrypt (unaligned)", ret == 0);
    ret = wc_AesGcmDecrypt(&aes, dec, ct, 32, iv, 12, tag, 16, NULL, 0);
    CHECK("AesGcmDecrypt (unaligned) verifies", ret == 0);
    CHECK("unaligned round-trip", memcmp(dec, pt, 32) == 0);
    wc_AesFree(&aes);
    ForceZero(key, 16);   /* scrub key material before return */
}

/* A non-12-byte GCM IV must hard-fail on the plaintext device too, NOT silently
 * fall back to software GCM (regression for the IV hard-error contract). */
static void plain_gcm_badiv_test(void)
{
    Aes  aes;
    byte key[16] __attribute__((aligned(32)));
    byte iv[16]  __attribute__((aligned(32)));   /* 16 bytes, not the supported 12 */
    byte pt[16]  __attribute__((aligned(32)));
    byte ct[16]  __attribute__((aligned(32)));
    byte tag[16] __attribute__((aligned(32)));
    int  ret;

    memset(key, 0x5A, sizeof(key)); memset(iv, 0x11, sizeof(iv));
    memset(pt, 0x33, sizeof(pt));

    dbg_printf("\r\n== AES-GCM plaintext key, non-12-byte IV must hard-fail "
               "==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(devId=WC_RTL8735B_AES_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, key, sizeof(key));
    CHECK("AesGcmSetKey(key,16)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag, sizeof(tag), NULL, 0);
    CHECK("16-byte IV rejected (no silent SW fallback)", ret != 0);
    wc_AesFree(&aes);
    ForceZero(key, sizeof(key));   /* scrub key material before return */
}
#endif /* WOLFSSL_RTL8735B_AES */

static void wolf_huk_thread(void* param)
{
    int ret;
#ifdef WOLFSSL_RTL8735B_AES
    int aesRet = 0;
#endif
    (void)param;

    dbg_printf("\r\n=== wolfCrypt AmebaPro2 (RTL8735B) HUK example ===\r\n");

