dgarske/wolfssl-examples/rtl8735b/main.c
    device_mutex_lock(RT_DEV_LOCK_CRYPTO);

    ret = wolfCrypt_Init();
    CHECK("wolfCrypt_Init", ret == 0);

    if (ret == 0) {
        ret = wc_Rtl8735b_HukRegister(WC_HUK_DEVID);
        CHECK("wc_Rtl8735b_HukRegister", ret == 0);
    }
#ifdef WOLFSSL_RTL8735B_AES
    /* The plaintext-key AES device is an optional add-on; track its registration
     * in its own result so a failure only skips its demo -- it must never
     * suppress the HUK suite or leak the HUK device registration. */
    if (ret == 0) {
        aesRet = wc_Rtl8735b_AesRegister(WC_RTL8735B_AES_DEVID);
        CHECK("wc_Rtl8735b_AesRegister", aesRet == 0);
    }
#endif
    if (ret == 0) {
        huk_gcm_test();
        huk_ecb_cbc_test();
        huk_ctr_test();
        huk_gcm_unaligned_test();
        huk_cbc_inplace_test();
        huk_gcm_badiv_test();
        huk_hmac_test();
        huk_ecdsa_test();
#ifdef WOLFSSL_RTL8735B_AES
        if (aesRet == 0) {
            plain_gcm_test();
            plain_ecb_test();
            plain_gcm_unaligned_test();
            plain_gcm_badiv_test();
            wc_Rtl8735b_AesUnRegister(WC_RTL8735B_AES_DEVID);
        }
#endif
        wc_Rtl8735b_HukUnRegister(WC_HUK_DEVID);
    }
    wolfCrypt_Cleanup();

    device_mutex_unlock(RT_DEV_LOCK_CRYPTO);
    dbg_printf("\r\n=== done ===\r\n");
    vTaskDelete(NULL);
}

int main(void)
{
    if (xTaskCreate(wolf_huk_thread, "wolf_huk", STACKSIZE, NULL,
                    tskIDLE_PRIORITY + 1, NULL) != pdPASS) {
        dbg_printf("xTaskCreate failed\r\n");
    }
    else {
        vTaskStartScheduler();
    }
    while (1) {
    }
}
